#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Количество() > 0 Тогда
		МассивНастроек = ОбменСГИСЭПДКлиентСервер.ТаблицаВМассивСтруктур(Выгрузить());	
		СервисВзаимодействияМПЭПДВызовСервера.СервисОтправитьНастройкиДополнительныхПолей(МассивНастроек);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(Запись.ИдентификаторНастройки) = Ложь Тогда
			Запись.ИдентификаторНастройки = Строка(Новый УникальныйИдентификатор());	
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры


#КонецОбласти

#КонецЕсли
