#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Роль = 0;
	Параметры.Свойство("Роль", Роль);
	
	ПредставленияАтомарныхРолейМП = СервисВзаимодействияМПЭПДКлиентСервер.ПредставленияРолейМП(Ложь);
	
	Для Каждого КиЗ Из ПредставленияАтомарныхРолейМП Цикл
		Пометка = Ложь;
		Если ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Роль, КиЗ.Ключ, ПредставленияАтомарныхРолейМП.Количество()) Тогда
			Пометка = Истина;
		КонецЕсли;
		СписокРолей.Добавить(КиЗ.Ключ, КиЗ.Значение, Пометка);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Роль = 0;
	Для Каждого ЭлементСписка Из СписокРолей Цикл
		Если ЭлементСписка.Пометка Тогда
			Роль = Роль + ЭлементСписка.Значение;
		КонецЕсли;
	КонецЦикла;

	Закрыть(Роль);

КонецПроцедуры

#КонецОбласти
