#Область СлужебныеПроцедурыИФункции

Функция ПроверкаДокументаНаСоответствиеТребованиямГИСМТ(ПараметрыПроверки) Экспорт
	
	Возврат СоответствиеТребованиямГИСМТ.ПроверкаДокументаНаСоответствиеТребованиямГИСМТ(ПараметрыПроверки);
	
КонецФункции

Функция ФоноваяПроверкаДокументовГИСМТРазрешена() Экспорт
	Возврат СоответствиеТребованиямГИСМТ.ФоноваяПроверкаДокументовГИСМТРазрешена();
КонецФункции

Функция СостояниеФоновойПроверкиДокумента(ИдентификаторЗадания, АдресРезультата) Экспорт
	Возврат СоответствиеТребованиямГИСМТ.СостояниеФоновойПроверкиДокумента(ИдентификаторЗадания, АдресРезультата);
КонецФункции

Процедура ПрерватьФоновуюПроверкуДокумента(ИдентификаторЗадания) Экспорт
	СоответствиеТребованиямГИСМТ.ПрерватьФоновуюПроверкуДокумента(ИдентификаторЗадания);
КонецПроцедуры

#КонецОбласти