///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ПодключитьОборудованиеПоТипу(Оповещение, Идентификатор, ТипыПО, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ЗавершитьПодключениеОборудования(Форма, РезультатПодключения, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ОтключитьОборудованиеПоТипу(ОписаниеОповещения, УникальныйИдентификатор, ТипыПО, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура НачатьПолучениеПараметровУстройства(Оповещение, Идентификатор, ИдентификаторУстройства, СтандартнаяОбработка) Экспорт

КонецПроцедуры

Процедура НачатьПолучениеОписанияОборудования(Оповещение, Идентификатор, ИдентификаторУстройства, СтандартнаяОбработка) Экспорт

КонецПроцедуры

Процедура УстановитьДрайверОборудования(Оповещение, Идентификатор, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура НачатьПолучениеОписанияДрайвера(Оповещение, Драйвер, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура НачатьТестУстройства(Оповещение, ИдентификаторОборудования, ПараметрыУстройства, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ВыполнитьНастройкуОборудования(Идентификатор, Оповещение, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ПолучитьРабочееМестоКлиента(РабочееМесто, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ПолучитьИдентификаторКлиентаДляРабочегоМеста(ИдентификаторКлиента, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ДанныеУстройства(ИдентификаторУстройства, ДанныеУстройства, СтандартнаяОбработка) Экспорт

КонецПроцедуры

Процедура СохранитьПараметрыУстройства(Идентификатор, ЗначенияНастроек, Результат, СтандартнаяОбработка) Экспорт

КонецПроцедуры 

Процедура ТипыПодключаемогоОборудования(ТипыПодключаемогоОборудования, СтандартнаяОбработка) Экспорт

КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные, СтандартнаяОбработка) Экспорт

КонецПроцедуры

#Область ЧекопечатающиеУстройства

Процедура ФискализацияЧековВОчереди(РазрешенаАвтоматическаяФискализация, ДополнительныеПараметры, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ПараметрыВыполненияОперацииНаАвтономнойККТ(ДополнительныеПараметры, СтандартнаяОбработка) Экспорт

КонецПроцедуры

Процедура ДобавитьЧекВОчередьЧековККТ(ПараметрыФискализации, ПараметрыПакетнойОперации, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ВыполнитьКомандуЗавершениеАвтономнойККТ(КодВозвратаДиалога, ДополнительныеПараметры, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура СформироватьТекстНефискальногоЧека(ПараметрыОперации, ТекстЧека, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ПараметрыПечатиТекста(ТекстЧека, ПараметрыПечати, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ПараметрыПечатиКопииЧека(ПараметрыПечати, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ПараметрыПечатиQRКодаНаФискальномУстройстве(ПараметрыПечати, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура НачатьПечатьТекста(ОповещениеПриЗавершении, УникальныйИдентификатор, Устройство, ПараметрыОперации, СтандартнаяОбработка) Экспорт

КонецПроцедуры

Процедура НачатьПечатьКопииЧека(ОповещениеПриЗавершении, УникальныйИдентификатор, Устройство, ПараметрыОперации, СтандартнаяОбработка) Экспорт

КонецПроцедуры

Процедура НачатьПечатьQRКодаНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, Устройство, ПараметрыОперации, СтандартнаяОбработка) Экспорт

КонецПроцедуры

Процедура НачатьФормированиеОтчетаБезГашения(ОповещениеПриЗавершении, УникальныйИдентификатор, Устройство, ПараметрыОперации, СтандартнаяОбработка) Экспорт

КонецПроцедуры 

Процедура НачатьОткрытиеДенежногоЯщика(ОповещениеПриЗавершении, УникальныйИдентификатор, Устройство, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура НачатьОткрытиеСменыНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, Устройство, ПараметрыОперации, ДополнительныеПараметры, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура НачатьЗакрытиеСменыНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, Устройство, ПараметрыОперации, ДополнительныеПараметры, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура НачатьПолучениеТекущегоСостоянияФискальногоУстройства(ОповещениеПриЗавершении, УникальныйИдентификатор, Устройство, ПараметрыОперации, ДополнительныеПараметры, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ВесовоеОборудование

Процедура НачатьПолученияВесаСЭлектронныхВесов(ОповещениеЗавершенияВзвешивания, УникальныйИдентификатор, ИдентификаторВесов, ПараметрыОперации, СтандартнаяОбработка) Экспорт

КонецПроцедуры

#КонецОбласти

#Область ДисплейПокупателя

Процедура ПодключенныеДисплеиПокупателяВыводятQRКод(Результат, СтандартнаяОбработка) Экспорт

КонецПроцедуры

Процедура ПараметрыОперацииДисплейПокупателя(ТекстКОтправке, ЗначениеQRКода, ПараметрыОперации, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура НачатьОчисткуДисплеяПокупателя(ОповещениеЗавершенияВзвешивания, УникальныйИдентификатор, ИдентификаторДисплея,
	ПараметрыОперации, ДополнительныеПараметры, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура НачатьВыводСтатусаРабочегоМестаНаДисплейПокупателя(ОповещениеЗавершенияВзвешивания, УникальныйИдентификатор, ИдентификаторДисплея,
	ПараметрыОперации, ДополнительныеПараметры, СтандартнаяОбработка) Экспорт

КонецПроцедуры

Процедура НачатьВыводИнформацииНаДисплейПокупателя(ОповещениеЗавершенияВзвешивания, УникальныйИдентификатор, ИдентификаторДисплея,
	ПараметрыОперации, ДополнительныеПараметры, СтандартнаяОбработка) Экспорт

КонецПроцедуры

Процедура НачатьВыводQRКодаНаДисплейПокупателя(ОповещениеЗавершенияВзвешивания, УникальныйИдентификатор, ИдентификаторДисплея,
	ПараметрыОперации, СтандартнаяОбработка) Экспорт

КонецПроцедуры

#КонецОбласти 

#Область ПлатежныеСистемы

Процедура НачатьПолучениеПараметровКарты(ОписаниеОповещения, УникальныйИдентификатор, СтандартнаяОбработка) Экспорт

КонецПроцедуры

Процедура НачатьВыполнениеОперацииНаЭквайринговомТерминале(Оповещение,
			УникальныйИдентификатор,
			ЭквайринговыйТерминал,
			ПараметрыОперации,
			ДополнительныеПараметры,
			ПодключаемоеОборудование,
			СтандартнаяОбработка) Экспорт
			
КонецПроцедуры

Процедура НачатьВыполнениеСверкиИтоговНаЭквайринговомТерминале(Оповещение,
			УникальныйИдентификатор,
			ЭквайринговыйТерминал,
			ПараметрыОперации,
			ДополнительныеПараметры,
			ОборудованиеСверки,
			СтандартнаяОбработка) Экспорт
			
КонецПроцедуры

Процедура ТипыПлатежнойСистемыККТ(ТипыПлатежнойСистемыККТ, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ТипыПакетнойОперацииВОчередиЧеков(ТипыПакетнойОперацииВОчередиЧеков, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область Маркировка

Процедура НачатьПодтверждениеКМ(ОповещениеОПроверкеКМ, УникальныйИдентификатор, 
		ПодключаемоеОборудованиеДляПроверкиМарки, ПараметрыПодтвержденияКМ, СтандартнаяОбработка) Экспорт

КонецПроцедуры

Процедура НачатьПолученияРезультатовЗапросаКМ(ОповещениеОЗавершении, УникальныйИдентификатор, ПодключаемоеОборудованиеДляПроверкиМарки, ПараметрыОперации, ДополнительныеПараметры, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура НачатьЗапросКМ(ОповещениеОЗавершении, УникальныйИдентификатор, ПодключаемоеОборудованиеДляПроверкиМарки, ПараметрыОперации, ДополнительныеПараметры, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура НачатьЗакрытииСессииРегистрацииКМ(ОповещениеОЗавершении, УникальныйИдентификатор, ПодключаемоеОборудованиеДляПроверкиМарки, ПараметрыОперации, ДополнительныеПараметры, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектронныеСертификаты

Процедура РасшифроватьQRКодЧекаККТ(ИдентификаторКорзиныНСПК, ДанныеШтрихкода, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ЭтоРеквизитыКартыQR(ИдентификаторКорзиныНСПК, ДанныеШтрихкода, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

Процедура МераКоличестваПредметаРасчетаЛитр(МераКоличестваПредметаРасчетаЛитр, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура СтатусОбработкиЗапросаПоУмолчанию(СтатусОбработкиЗапросаПоУмолчанию, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура СтатусРезультатаПоУмолчанию(СтатусРезультатаПоУмолчанию, СтандартнаяОбработка) Экспорт

КонецПроцедуры

Процедура СтатусТовараПоУмолчанию(СтатусТовараПоУмолчанию, СтандартнаяОбработка) Экспорт

КонецПроцедуры

Процедура ПланируемыеСтатусыМаркированногоТовара(ПланируемыеСтатусыМаркированногоТовара, СтандартнаяОбработка) Экспорт

КонецПроцедуры

Процедура СтатусРезультатаОжидается(СтатусРезультатаОжидается, СтандартнаяОбработка) Экспорт

КонецПроцедуры 

#КонецОбласти
