
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ВариантЗагрузкиДанных",          ВариантЗагрузкиДанных);
	Параметры.Свойство("ИмяИдентификатора",              ИмяИдентификатора);
	Параметры.Свойство("РазмерПорцииЗагрузкиДанных",     РазмерПорцииЗагрузкиДанных);
	Параметры.Свойство("СоздатьЭлементыНоменклатуры",    СоздатьЭлементыНоменклатуры);
	Параметры.Свойство("ЗагрузитьЦеныПродажи",           ЗагрузитьЦеныПродажи);
	Параметры.Свойство("ЗаписатьЦеныОтдельнойКомандой",  ЗаписатьЦеныОтдельнойКомандой);
	Параметры.Свойство("ЗагрузитьИзображения",           ЗагрузитьИзображения);
	Параметры.Свойство("СортироватьСтрокиДереваТоваров", СортироватьСтрокиДереваТоваров);
	
	Параметры.Свойство("ДокументУстановкаЦенНоменклатуры", ДокументУстановкаЦенНоменклатуры);
	
	ОграничитьРазмерПорцииЗагрузкиДанных = ЗначениеЗаполнено(РазмерПорцииЗагрузкиДанных);
	Элементы.ЗагрузитьЦеныПродажи.Доступность = ПравоДоступа("Проведение", Метаданные.Документы.УстановкаЦенНоменклатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОграничитьРазмерПорцииЗагрузкиДанныхПриИзменении(Элемент)
	
	Если ОграничитьРазмерПорцииЗагрузкиДанных Тогда
		Если РазмерПорцииЗагрузкиДанных = 0 Тогда
			РазмерПорцииЗагрузкиДанных = 1000;
		КонецЕсли;
		РазмерПорцииЗагрузкиДанных = Макс(1, РазмерПорцииЗагрузкиДанных);
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура РазмерПорцииЗагрузкиДанныхПриИзменении(Элемент)
	
	Если РазмерПорцииЗагрузкиДанных = 0 Тогда
		ОграничитьРазмерПорцииЗагрузкиДанных = Ложь;
		УстановитьВидимостьДоступность();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЦеныПродажиПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Результат = Новый Структура;    
	Результат.Вставить("ВариантЗагрузкиДанных",          ВариантЗагрузкиДанных);
	Результат.Вставить("ИмяИдентификатора",              ИмяИдентификатора);
	Результат.Вставить("РазмерПорцииЗагрузкиДанных",     ?(ОграничитьРазмерПорцииЗагрузкиДанных, РазмерПорцииЗагрузкиДанных, Неопределено));
	Результат.Вставить("СоздатьЭлементыНоменклатуры",    СоздатьЭлементыНоменклатуры);
	Результат.Вставить("ЗагрузитьЦеныПродажи",           ЗагрузитьЦеныПродажи);
	Результат.Вставить("ЗаписатьЦеныОтдельнойКомандой",  ЗаписатьЦеныОтдельнойКомандой);
	Результат.Вставить("ЗагрузитьИзображения",           ЗагрузитьИзображения);
	Результат.Вставить("СортироватьСтрокиДереваТоваров", СортироватьСтрокиДереваТоваров);
	Результат.Вставить("ДокументУстановкаЦенНоменклатуры", ДокументУстановкаЦенНоменклатуры);
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	Элементы.РазмерПорцииЗагрузкиДанных.Видимость           = ОграничитьРазмерПорцииЗагрузкиДанных;
	Элементы.ОграничитьРазмерПорцииЗагрузкиДанных.Заголовок = ?(ОграничитьРазмерПорцииЗагрузкиДанных,
		НСтр("ru = 'Ограничить получение данных для карточек товаров до'"),
		НСтр("ru = 'Ограничить получение данных для карточек товаров'"));
	Элементы.ГруппаЗаписатьЦеныОтдельнойКомандой.Доступность = ЗагрузитьЦеныПродажи;
	
	Элементы.ГруппаДокументУстановкаЦенНоменклатуры.Доступность = ЗагрузитьЦеныПродажи;
КонецПроцедуры

#КонецОбласти
