#Область ОписаниеПеременных

// Структура с кодами возможных операций сотрудника на КСО.
&НаКлиенте
Перем ВозможныеОперации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Масштаб = Параметры.Масштаб;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВозможныеОперации = ИнтерфейсРМКСлужебныйКлиент.ВозможныеОперацииСотрудникаВКСО();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРаботу(Команда)
	
	Закрыть(ВозможныеОперации.ЗавершитьРаботу);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЧек(Команда)
	
	Закрыть(ВозможныеОперации.ПроверитьЧек);
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяВРежимКассыСамообслуживания(Команда)
	
	Закрыть(ВозможныеОперации.ПродолжитьРаботу);
	
КонецПроцедуры

#КонецОбласти




